import TextField from "@mui/material/TextField";
import Autocomplete from "@mui/material/Autocomplete";
import * as React from "react";

interface CityInputFieldProps {
    city: string,
    setCity: any,
    labelText: string
}

export default function CityAutocompleteInputField({city, setCity, labelText}: CityInputFieldProps) {
    const belarus_cities_ru = ["Барановичи", "Барань", "Белоозёрск", "Белыничи", "Березино", "Берёза", "Берёзовка", "Бобруйск", "Борисов", "Браслав", "Брест", "Буда-Кошелёво", "Быхов", "Василевичи", "Верхнедвинск", "Ветка", "Вилейка", "Витебск", "Волковыск", "Воложин", "Высокое", "Ганцевичи", "Глубокое", "Гомель", "Горка", "Горки", "Городок", "Гродно", "Давид-Городок", "Дзержинск", "Дисна", "Добруш", "Докшицы", "Дороги", "Дрогичин", "Дубровно", "Дятлово", "Ельск", "Жабинка", "Житковичи", "Жлобин", "Жодино", "Заславль", "Иваново", "Ивацевичи", "Ивье", "Калинковичи", "Каменец", "Кировск", "Клецк", "Климовичи", "Кличев", "Кобрин", "Копыль", "Коссово", "Костюковичи", "Кричев", "Круглое", "Крупки", "Лепель", "Лида", "Логойск", "Лунинец", "Любань", "Ляховичи", "Малорита", "Микашевичи", "Минск", "Миоры", "Могилёв", "Мозырь", "Молодечно", "Мосты", "Мстиславль", "Мядель", "Наровля", "Несвиж", "Новогрудок", "Новолукомль", "Новополоцк", "Орша", "Осиповичи", "Островец", "Ошмяны", "Петриков", "Пинск", "Полоцк", "Поставы", "Пружаны", "Речица", "Рогачёв", "Светлогорск", "Свислочь", "Сенно", "Скидель", "Славгород", "Слоним", "Слуцк", "Смолевичи", "Сморгонь", "Солигорск", "Столбцы", "Столин", "Толочин", "Туров", "Узда", "Фаниполь", "Хойники", "Чаусы", "Чашники", "Червень", "Чериков", "Чечерск", "Шклов", "Щучин"]
    return (<Autocomplete
        value={city}
        onChange={(event: any, newValue: string | null) => {
            setCity(newValue);
        }}
        options={belarus_cities_ru}
        renderInput={(params) => <TextField {...params} label={labelText} fullWidth/>}
    />)
}