const belarus_cities_ru = ["Барановичи","Барань","Белоозёрск","Белыничи","Березино","Берёза","Берёзовка","Бобруйск","Борисов","Браслав","Брест","Буда-Кошелёво","Быхов","Василевичи","Верхнедвинск","Ветка","Вилейка","Витебск","Волковыск","Воложин","Высокое","Ганцевичи","Глубокое","Гомель","Горка","Горки","Городок","Гродно","Давид-Городок","Дзержинск","Дисна","Добруш","Докшицы","Дороги","Дрогичин","Дубровно","Дятлово","Ельск","Жабинка","Житковичи","Жлобин","Жодино","Заславль","Иваново","Ивацевичи","Ивье","Калинковичи","Каменец","Кировск","Клецк","Климовичи","Кличев","Кобрин","Копыль","Коссово","Костюковичи","Кричев","Круглое","Крупки","Лепель","Лида","Логойск","Лунинец","Любань","Ляховичи","Малорита","Микашевичи","Минск","Миоры","Могилёв","Мозырь","Молодечно","Мосты","Мстиславль","Мядель","Наровля","Несвиж","Новогрудок","Новолукомль","Новополоцк","Орша","Осиповичи","Островец","Ошмяны","Петриков","Пинск","Полоцк","Поставы","Пружаны","Речица","Рогачёв","Светлогорск","Свислочь","Сенно","Скидель","Славгород","Слоним","Слуцк","Смолевичи","Сморгонь","Солигорск","Столбцы","Столин","Толочин","Туров","Узда","Фаниполь","Хойники","Чаусы","Чашники","Червень","Чериков","Чечерск","Шклов","Щучин"]

export default function Allrides() {
    const pairs = [];
    for (let i = 0; i < belarus_cities_ru.length; i++) {
        for (let j = i + 1; j < belarus_cities_ru.length; j++) {
            if (belarus_cities_ru[i] !== belarus_cities_ru[j]) {
                pairs.push(`${belarus_cities_ru[i]}/${belarus_cities_ru[j]}`);
            }
        }
    }

    return (
        <div>
            <ul>
                {pairs.map((pair, index) => (
                    <li key={index}>
                        <a href={`/ride-sharing/${pair}`}>{pair}</a>
                    </li>
                ))}
            </ul>
        </div>
    );
}
